{
  "subreddit name": [
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "legaladvice", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance", 
    "personalfinance"
  ], 
  "comments": [
    "I stopped talking to my ex-boyfriend three months ago. I also made it very clear before I stopped talking to him that I wanted nothing to do with him and that he was not to contact me again. \n\nDespite this, he managed to stalk down a few of my Reddit accounts and send me unwanted messages, emails me through different emails to bypass my block filers, calls me from a blocked number, and even somehow found my Yelp account and sent me a message there.\n\nAlthough the messages are not threatening in nature, due to their unwanted nature it feels like harassment. Again, I had made it very clear that he was to leave me alone. I do not like this person and want nothing to do with them and have returned none of these messages,\n\nThat being said, what are my options? My friends and family agree he is harassing and stalking me, but feel there’s nothing I can do. I feel there is likely little I can do either aside from changing my phone number, email address, and social media accounts, but wanted of be sure.\n\nThanks!\n\nEdit: US, Hawaii, [HI]", 
    "Posting from South East Michigan\n\nHello r/legaladvice,\nI have found myself in need of legal advice due to our neighbors' gas powered generator. Since December, our neighbors have been running a gas generator nonstop. The only times it is off is when they are refilling it with gas. Dealing with the noise for five months has been irritating, to say the least. However, we have not called the police because we have been worried that they have had no electricity due to unpaid bills. We have also been worried about getting law enforcement involved because we don't want to cause a rift between us and them.\n\nToday things got worse than just dealing with noise. Something has changed with the generator and the whole yard started smelling like gas fumes. Now, the gas fumes are getting inside our house. I know that the generator violates noise oridnances, but I feel like the fumes are a much serious issue due to health reasons. \n\nDoes anyone:\na.) Know what we can do legally to address this problem (especially with the fumes) \nb.) Have strategies to approach this issue to avoid escalating tensions any more than they need to be.\nAny advice would be greatly appreciated.", 
    "So I was mailed a late notice Traffic violation caught on camera when I never received the initial warning. The location was at the intersection of Marcus Ave and Lakeville Rd in Nassau County going westbound. The video shows me turning right at a red when the seperate yellow turn arrow disappeared. I've never seen a sign on that corner saying I can't turn on red in my 25 years of living here in Long Island. A fee was also added for the late notice but I never received the warning to begin with. I am very thorough with my mail since I take care of all the bills for the house. What can I do to lower the fine or can I brush off a camera ticket? I'm not even sure how I can fight the late fee either when I never received the warning. I'm at a loss here. Any advice would truly help.", 
    "Hi, throwaway because this might be a recognizable  situation. I work for a tech startup in Ohio as a software developer, and I’ve been working here for 2 years. \n\nMy equity in the company is supposed to vest (stock grant) on Tuesday. My employer is now threatening to fire me tomorrow unless I sign a contract extending my vesting cliff a year. Is there anything I can do? \n\nThanks for reading\n\nTl;dr see title", 
    "I live in an apartment complex in a small town in Washington and have noticed a tenant leaving large items, ie.    a kayak, tires, etc. on the curb above the complex. \n\nBasically they remove the items from their truck and \"store\" them here.  \n\nIt is a street above our complex where some people park but the property where the items are left is unowned. \n\nI have spent some time lately cleaning this area as people have always trashed it as it has a nice lookout over the town and is a popular spot for kids to go. \n\nCan I throw the items away? Should I tell the police?", 
    "I am in NYC. I gifted Estee Lauder daywear cosmetics to my wife. I bought it from Macy's in Herald Square. After using the product for a week, she noticed her skin was getting dry and itchy. She discontinued. Now her skin has peeled off. Areas look like it suffered chemical burns. \n\nWe want to sue Estee Lauder. Online reviews show we aren't the only ones having problems. Theres been stories of people rushed to the ER. \n\nAny recommendations? Should we seek out a class action lawyer? How about a plaintiff's side personal injury firm? What about consumer rights advocates? Or the FDA?", 
    "Thank you for taking the time to look at my post.\n\nThe details of the household shall remain private, full stop. The reasons behind their actions remain unknown, but for the purposes of this post aren't relevant.\n\n I am only interested in hearing about any Canadian Federal or Alberta Provincial laws potentially being broken here. I am doing my own research, and have already sent an email off to my lawyer outlining the situation as the title iterates, but I figured I would make sure that all my bases are covered and neither I or my lawyer are missing anything. \n\nIf you have any questions, please put them in the comments. I will answer as many as I can.\n\nThe housemate in question will be dealt with, legally, in short order. No advice is needed there, thank you.\n\nCheers, and thanks for the help.", 
    "Hey guys,\n\nI got a speeding ticket for going 5 mph above the speed limit. I am a Massachusetts resident but got pulled over in New York for speeding. I pled not guilty and my hearing is coming up. I don't know how any of this works. This is my first speeding ticket ever. Any advice would help, thank you!", 
    "What would happen in Nevada if the estate of the deceased  did not pay the hospital bills  and just cashed out the $ and spent it?", 
    "I need advice on a small claims matter with serving paperwork?\n I have tried everything for three months and the court clerks are no help, legal services didn't even want to bother with me, and a few lawyers I knew didnt want to help either, also all the Marshals I talked to pretty much said I'm screwed... I don't know what to do and it's starting to get very hard...\nMy question is with sending the certified letters. Because I have no address other than his father's address which he does not live at. People at work said he has been evicted from his place in Portland which there is no record of that address and he won't tell anyone cause he knows I'm hunting for him. Also the marshal in Portland found his dad's address for me and told me his current phone number was disconnected. I dont know any other phone number besides that. Also I have been told that the marshals can not use Facebook to contact a person. Marshals will not serve at EB (our place of work,) and the will not serve him at the base he goes to for drill. So my last option is to do it through certified mail which I have already done and it got sent back cause no one signed for it. \nSo with that in mind I was going to do the last resort option, which if legal, was send a letter to his father's residence and to his father's work (both he goes to on weekends) with his father's name and under it \"Attention: his name\" so that his father has no option to sign it and give it to him. As well as, if I can find the addresses, send one to his mother, grandmother, girlfriend, Sargent in his command, and bestfriend to get these stupid papers to him. \nI do not have the money to post it in two newspapers, which would be $400 to run the suit in the paper, and it technically does not count as serving. And I absolutely do not have the money to hire a PI, which would run me $1200. \n\nI have been hunting this kid and wasting my money to serve him these papers since January. I'm on the edge, running out of options and beyond frustrated. It's as easy as handing a supervisor the paperwork and having it handed to him that day. I'm losing my mind and I just want my damn money.", 
    "I'm 24, and make a 60k salary. Each month, I take home a little over $3510 and have been trying to figure out the best way to spend my extra money. Initially, my biggest priority after getting a job a few years ago was to try to pay off my student loans within 4 years instead of 10. But since I've paid off the loans that accrued the most interest (around 6%), I'm concerned that there must be better ways to spend my money right now.\n\nI have around $6.3k left in student loans (at a 3.1-4% interest rate). I've paid off around $4,000 ahead of schedule by contributing $250/month instead of $125/month (10-year plan).\n\nMy 401k is around $3910 - unfortunately, my company doesn't match and I haven't been contributing much because of that.\n\nI also have $6.5k in extra funds that are sitting in my savings account. I'm not sure what the wisest thing to do with this money would be - possibly a HYSA?\n\nWhat would be the wisest way to spend my money? After reading through this subreddit, it seems like paying my loans at a lower rate, contributing more to retirement, and setting aside more for my savings account would be better. Any advice welcome.\n\n&#x200B;\n\nThanks!", 
    "Oh Canada, Oh Canada, how I want to study there.\n\n&#x200B;\n\nI'm 34 and back in college after a bad accident left me with seizures and CRPS (degenerative nerve condition).  I'm finally going to get compensated and have been considering where to transfer to.  The problem here is that my little community college isn't internationally recognized so If I go to Canada I'd have to start over.  Part-time because too much school is a seizure trigger.\n\n&#x200B;\n\nThe benefits of Canada: $500/year health care.  Internationally recognized colleges.  LOW tuition cost (lower than my current community college).  City life, no car.\n\n&#x200B;\n\nThe downside: I'd want to leave sooner, that means leaving my grandmother before my uncle (who lives on the property but not in the house) retires.  I'm stretching out my units so that my major classes are being taken one semester at a time and I'm very close to maxing all my transferable units.  This would all be lost.  Over 90 units.  High housing costs (near double Texas and Arizona).  Can't work part-time unless I'm going to school full-time.  Can't do that because of my seizures.  This also means my masters in engineering will be about 10 years.\n\n&#x200B;\n\nIf I stay state-side benefits: Texas A&M is my top pick.  GREAT housing costs.  Same with Northern Arizona, GREAT housing costs.  Texas is internationally recognized so I wouldn't be losing my work and I can transfer in.  Can work part-time.  Time to my masters would be about 4 years.\n\n&#x200B;\n\nThe downside: Health care costs.  If I lose my medical one ER visit is over $200,000 PLUS the ambulance.  Higher tuition costs by tens of thousands per year.  I'd probably also have to get a car and that also means gas and insurance because neither Texas or Arizona have public transit comparable to Vancouver or Toronto.\n\n&#x200B;\n\nI'm also considering going on disability, I fully qualify.  If I stay stateside and I can work a few hours a week (that's my honest max anyway).  In between disability and a few hours a week of work I could have some sort of income as opposed to Canada where I'd just be spending.\n\n&#x200B;\n\nWhat do you guys think?  I know education is my best investment, but this also means living expenses and time.\n\n&#x200B;\n\nEdited to add:   Had the \"this is real\" conversation with my Grandma and an honest conversation about her needs.  IF I stay in the US she'll probably move in with me and contribute.  This leads me more toward staying in the US because I just don't think my uncle is capable of taking care of her.  Happy and Sad to say that my decision will be made less from a fiscal standpoint.", 
    "I'm making $68k currently and contribute 5% biweekly to my 401k. I would like to increase my contribution to at least 10%. Now, my employer does not offer any 401k matching so I'm wondering if I'm better off opening a Roth IRA and starting to put my additional contribution to that account instead. And if so, how should I split my overall contribution between the two accounts? Any help would be greatly appreciated.", 
    "\nI just received a letter from PennyMac stating that my loan is transferring to them.  Quick Google search brought so many bad review. Is there anything that I can do to stop or change it? \n\nI have read that they usually require $1000 to fund the escrow. They are bad at handling payments etc. \n\nWhat can I expect from this new servicer? I am sure they are going to nickle and dime us with late fees and possibly mess up tax etc. \n\nAlso heard bad customer service for releasing insurance claim funds.\n\nAny one familiar with PennyMac?", 
    "Family ruined my credit when I was young. All are paid off and cancelled, but now, my husband has to sign for everything, and I can’t get my name on anything. \n\nWhat steps can I take to get an actual credit card to begin rebuilding trust in my name? \n\nThanks for any advice!", 
    "Long story short my bank account is pretty dry even though just getting a tax refund and i put most of that money towards easter baskets and anniversary gifts and things like that recently after getting some car work done that totaled near $1000. my grand mother had payed for that for me.\n\nnow were about a month after that work i went to get my car inspection done so goodbye 40$ and while were they're my mechanic tells me that i have a blown valve cover gasket which i had assumed from some minor research on what i had noticed now a week after my inspection today my cars check engine light is flashing at me i have no money to bring it to the shop and an $800 expense looming over my head even though i had just fixed my car and i'm stuck i don't know what to do. i still have to get too and from work along with driving my GF to and from work occasionally. my car is only a 2000 Nissan frontier so its not a brand new car and i'm not entirely devoted to it if the best option is to junk it or trade it in. i need help and some guidance and a first step my bi weekly income is only around $320 aswell\n\n&#x200B;\n\nTL:DR\n\nincome 320 \n\nno budget\n\nneed a car for living \n\nim 21 M\n\nand a looming 1000$ charge for more repairs on my 2000 nissan frontier", 
    "Hi yall!   \n\nMy wife and I have one home business that we've been living off of for 5 years and we are about to start another business, all while I am 300k in debt from student loans. Here are the facts:\n\n&#x200B;\n\nBusiness 1 (been operating for 5 years) our profit from business 1 after expenses is about 20k for the year.  This is mostly a cash business (although i do report all cash etc.)\n\n&#x200B;\n\nBusiness 2 will be a delivery business and our adjusted income at the end of the year after expenses will probably be 100k.\n\n&#x200B;\n\nDebt- i have 280k in student loans from undergrad and grad school (Im currently in the process of getting out of default).  These loans are going to go on an Income based repayment plan, where basically they will take 10% of my MAGI. (income). \n\n&#x200B;\n\nFamily- My wife and I are married and have two kids.\n\n&#x200B;\n\nHow should i structure this?  Im thinking leave our business one as an LLC with my wife and I owning 50% each, (we pay ourselves 10k each a year).  Then put business 2 solely in her name, and pay me as an employee every now and then?  Also, for my student loans I feel like we should file taxes separately so it only counts my income.  Thoughts?", 
    "Hey guys,\n\nBy the title, I currently do not have credit but I saw that I can switch to a credit union, apply for a credit card, and take out a loan to buy a used car. Is this feasible and a bad decision?", 
    "My companies RSU's are through morgan stanley. I'd prefer a single hub to manage my RSUs however. Is there any downside from transferring my vested RSU money from morgan stanley to my personal brokerage account other than the 5$ transaction fee? I would just rebuy my company through my personal account once it's transferred.", 
    "My new temp agency is offering me 401K match:  $1.00 for $1.00 on the first 3% of the money you contribute and 0.50¢ per dollar on the next 2%, up to a maximum of 4% of your base annual salary.\n\n&#x200B;\n\nIs this worth putting money into?"
  ]
}